read_verilog verilog/*.v toplevel.v
hierarchy -top top
proc
opt                                                    # <-- Stat before synth: raw RTL stats
synth_ice40 -top top -abc9                           # <-- Stat after synthesis: mapped cells
write_json sail.json
